Repository: Barryrn/weighttracker
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Home Page
pl: Strona główna

source: Current
pl: Obecny

source: Goal
pl: Cel

# remaining
source: Remain
pl: Pozostało

source: Complete
pl: Zakończono

source: Energy Expenditure
pl: Wydatkowanie energii

source: TDEE Calories
pl: Kalorie TDEE

source: Goal Weight TDEE
pl: TDEE dla wagi docelowej

source: No images available
pl: Brak dostępnych zdjęć

source: Please upload images to track your progress
pl: Prześlij zdjęcia, aby śledzić swój postęp

source: Upload Images
pl: Prześlij zdjęcia

source: View All Images
pl: Zobacz wszystkie zdjęcia

source: Image Timeline
pl: Oś czasu zdjęć

source: No Comparison
pl: Brak porównania

source: Add more entries
pl: Dodaj więcej wpisów

source: No similar weight entry found
pl: Nie znaleziono podobnego wpisu wagowego

source: front
pl: przód

source: back
pl: tył

source: side
pl: bok

# frontCapital
source: Front
pl: Przód

# backCapital
source: Back
pl: Tył

# sideCapital
source: Side
pl: Bok

source: Pic 1
pl: Zdjęcie 1

source: Pic 2
pl: Zdjęcie 2

# errorLoadingImages
source: No Image uploaded yet
pl: Nie przesłano jeszcze żadnego obrazu

source: My Goals
pl: Moje cele

source: More Settings
pl: Więcej ustawień

# progressPage
source: Progress
pl: Postęp

# addWeightEntry
source: Add Entry
pl: Dodaj wpis

source: Fat Percentage Calculator
pl: Kalkulator procentu tkanki tłuszczowej

source: Neck Circumference
pl: Obwód szyi

source: Waist Circumference
pl: Obwód talii

source: Hip Circumference
pl: Obwód bioder

source: Calculation formula
pl: Wzór obliczeniowy

source: Male
pl: Mężczyzna

source: Female
pl: Kobieta

source: Other
pl: Inne

source: Error calculating body fat percentage
pl: Błąd obliczania procentu tkanki tłuszczowej

source: Calculate Body Fat
pl: Oblicz procent tłuszczu

source: Calculated Body Fat Percentage
pl: Obliczony procent tkanki tłuszczowej

source: Use This Result
pl: Użyj tego wyniku

source: Health Sync Settings
pl: Ustawienia synchronizacji zdrowia

source: Compare your progress
pl: Porównaj swój postęp

source: No weight data
pl: Brak danych wagowych

source: Image Gallery
pl: Galeria zdjęć

source: No images match the current filters
pl: Brak zdjęć pasujących do bieżących filtrów

source: Clear Filters
pl: Wyczyść filtry

source: Weight Range
pl: Zakres wagi

source: Date Range
pl: Zakres dat

source: Select Date Range
pl: Wybierz zakres dat

source: Tags
pl: Tagi

source: Image Types
pl: Rodzaje zdjęć

source: Export to Gallery
pl: Eksportuj do galerii

source: Image saved to gallery
pl: Obraz zapisany do galerii

source: Cancel
pl: Anuluj

source: Failed to save image
pl: Nie udało się zapisać zdjęcia

source: Permission denied to save images
pl: Odmowa uprawnień do zapisu zdjęć

source: Error saving image
pl: Błąd zapisywania zdjęcia

source: Finish
pl: Zakończ

source: Next
pl: Dalej

source: Skip
pl: Pomiń

source: Welcome to Weight Tracker
pl: Witamy w Weight Tracker

source: Track your weight, set goals, and monitor your progress over time.
pl: Śledź swoją wagę, ustalaj cele i monitoruj postępy w czasie

source: Let's set up your profile to get started!
pl: Skonfigurujmy Twój profil, aby rozpocząć

source: Choose Your Units
pl: Wybierz jednostki

source: Select your preferred units for weight and height measurements.
pl: Wybierz preferowane jednostki do pomiaru wagi i wzrostu

source: Your Information
pl: Twoje dane

source: We need some basic information to calculate your goals accurately.
pl: Potrzebujemy podstawowych informacji, aby dokładnie obliczyć Twoje cele

source: Please fill in all fields to continue
pl: Wypełnij wszystkie pola, aby kontynuować

source: Your Daily Energy Needs
pl: Twoje dzienne zapotrzebowanie energetyczne

source: Based on your information, we can estimate your daily calorie needs.
pl: Na podstawie Twoich danych możemy oszacować dzienne zapotrzebowanie kaloryczne

source: Profile
pl: Profil

source: Click Me
pl: Kliknij mnie

source: Profile Settings
pl: Ustawienia profilu

source: Tag Settings
pl: Ustawienia tagów

source: Error
pl: Błąd

source: Retry
pl: Ponów próbę

source: No tags found. Add tags when entering weight data.
pl: Nie znaleziono tagów. Dodaj tagi podczas wprowadzania danych wagowych

source: Delete Tag
pl: Usuń tag

source: Are you sure you want to delete the tag
pl: Czy na pewno chcesz usunąć ten tag

source: This will remove it from all entries in the database
pl: To usunie go ze wszystkich wpisów w bazie danych

source: Delete
pl: Usuń

source: TDEE Calculator
pl: Kalkulator TDEE

source: Unit Conversion
pl: Konwersja jednostek

source: No weight data available
pl: Brak dostępnych danych wagowych

source: Average Weight
pl: Średnia waga

source: Calories (kcal)
pl: Kalorie (kcal)

source: Entry deleted successfully
pl: Wpis został pomyślnie usunięty

source: Failed to delete entry
pl: Nie udało się usunąć wpisu

source: Error deleting entry
pl: Błąd usuwania wpisu

source: Delete Entry
pl: Usuń wpis

# deleteEntryConfirmation
source: Are you sure you want to delete this entry? This action cannot be undone.
pl: Czy na pewno chcesz usunąć ten wpis? Tej operacji nie można cofnąć

source: Body Fat Percentage (%)
pl: Procent tkanki tłuszczowej (%)

source: View Photo
pl: Zobacz zdjęcie

source: Take Photo
pl: Zrób zdjęcie

source: Choose from Gallery
pl: Wybierz z galerii

source: Delete Photo
pl: Usuń zdjęcie

source: Camera permission is required to take photos
pl: Wymagane jest zezwolenie na użycie aparatu

source: Photos permission is required to select images
pl: Wymagane jest zezwolenie na dostęp do zdjęć

source: Error deleting image
pl: Błąd usuwania zdjęcia

source: Progress Photos
pl: Zdjęcia postępu

source: Notes
pl: Notatki

source: Entry saved successfully
pl: Wpis został pomyślnie zapisany

source: Failed to save entry
pl: Nie udało się zapisać wpisu

source: Save
pl: Zapisz

source: TDEE Information
pl: Informacje o TDEE

# needToTrackYourInformation
source: You need to track your weight and calorie intake for 7 consecutive days before the TDEE will be available.
pl: Musisz śledzić swoją wagę i spożycie kalorii przez 7 kolejnych dni, aby TDEE było dostępne

source: Weight Goal
pl: Cel wagowy

source: Set your start weight
pl: Ustaw wagę początkową

source: Set your goal weight
pl: Ustaw wagę docelową

source: Your progress will be tracked against this goal
pl: Twój postęp będzie porównywany do tego celu

source: No data available
pl: Brak dostępnych danych

source: No data available for selected metric
pl: Brak danych dla wybranej metryki

# noDataAvailableForThisPeriod
source: No data available for this time period
pl: Brak danych dla tego okresu

source: Day
pl: Dzień

source: Week
pl: Tydzień

source: Month
pl: Miesiąc

source: Year
pl: Rok

source: Based on
pl: Na podstawie

source: Birthday
pl: Data urodzenia

source: Gender
pl: Płeć

source: Select Gender
pl: Wybierz płeć

source: Height
pl: Wzrost

source: Adjust Height
pl: Dostosuj wzrost

# saveUpper
source: SAVE
pl: ZAPISZ

# cancelUpper
source: CANCEL
pl: ANULUJ

source: Health Integration
pl: Integracja ze zdrowiem

source: TDEE Calculator (Calories)
pl: Kalkulator TDEE (Kalorie)

source: Weight Change Goal TDEE
pl: TDEE dla zmiany wagi docelowej

source: Please enter a valid positive number
pl: Wprowadź prawidłową dodatnią liczbę

source: Insufficient data to calculate goal TDEE
pl: Niewystarczające dane do obliczenia TDEE celu

source: Weight Change TDEE
pl: TDEE dla zmiany wagi

source: Based on your weight change and calorie intake over time.
pl: Na podstawie zmiany wagi i spożycia kalorii w czasie

# calculationFormulaText
source: This calculation uses the formula: TDEE = (CaloriesConsumed + (WeightChange_kg Ã— 7700)) / Days
pl: To obliczenie wykorzystuje wzór: TDEE = (SpożyteKalorie + (ZmianaWagi_kg × 7700)) / Dni

source: calories
pl: kalorie

source: Your estimated daily calorie needs
pl: Twoje szacowane dzienne zapotrzebowanie kaloryczne

# infoNoteCalorieTimeCalculation
source: Note: This calculation requires at least 7 consecutive days of weight and calorie data. It will use up to 14 days of continuous data for more accuracy.
pl: Uwaga: To obliczenie wymaga co najmniej 7 kolejnych dni danych o wadze i kaloriach. Może użyć do 14 dni ciągłych danych dla większej dokładności

source: This calculation automatically updates when you add new entries.
pl: To obliczenie aktualizuje się automatycznie po dodaniu nowych wpisów

source: Home
pl: Start

source: Progress
pl: Postęp

source: Add
pl: Dodaj

source: Goals
pl: Cele

source: More
pl: Więcej

source: Syncing will
pl: Synchronizacja spowoduje

# dataSendToHealthApp
source: Send your weight, body fat percentage, and BMI data to Health App
pl: Wysłanie danych o wadze, procencie tkanki tłuszczowej i BMI do aplikacji Zdrowie

# importDataFromHealthApp
source: Import weight, body fat percentage, and BMI measurements from health services
pl: Importowanie pomiarów wagi, procentu tkanki tłuszczowej i BMI z usług zdrowotnych

source: Keep both systems up to date
pl: Utrzymuj oba systemy w aktualnym stanie

# infoHealthServicesNotAvailable
source: Health services are not available on your device. This feature requires Apple Health on iOS or Health Connect on Android.
pl: Usługi zdrowotne nie są dostępne na tym urządzeniu. Wymagane jest Apple Health na iOS lub Health Connect na Androidzie

source: No images match the current filter criteria
pl: Brak zdjęć spełniających bieżące kryteria filtrów

source: No image available for this view
pl: Brak zdjęcia dla tego widoku

source: No images available for this view
pl: Brak dostępnych zdjęć dla tego widoku

source: Only one image available for this view
pl: Dostępne jest tylko jedno zdjęcie dla tego widoku

source: Total Daily Energy Expenditure (TDEE)
pl: Całkowite dzienne wydatkowanie energii (TDEE)

# kcalPerDay
source: kcal/day
pl: kcal/dzień

source: Not calculated
pl: Nie obliczono

source: Activity Level
pl: Poziom aktywności

# infoTextTdeeEstimate
source: This is a first estimate of your TDEE based on age, weight, gender, and activity level. For a more precise result, track your body weight and calorie intake for at least 7 continuous days.
pl: To jest wstępne oszacowanie Twojego TDEE na podstawie wieku, wagi, płci i poziomu aktywności. Aby uzyskać dokładniejszy wynik, śledź wagę i spożycie kalorii przez co najmniej 7 kolejnych dni

source: Fat:
pl: Tłuszcz:

source: Weight
pl: Waga

# fatPercentSign
source: Fat %
pl: Tłuszcz %

source: Body Fat
pl: Tkanka tłuszczowa

source: Table View
pl: Widok tabeli

source: Graph View
pl: Widok wykresu

source: Chart View
pl: Widok diagramu

source: entry
pl: wpis

source: entries
pl: wpisy

source: Not set
pl: Nie ustawiono

source: Gain Weight
pl: Przytyj

source: Lose Weight
pl: Schudnij

source: Weight Change per Week
pl: Zmiana wagi na tydzień

source: Base TDEE
pl: Bazowe TDEE

source: Weight Change
pl: Zmiana wagi

source: Calorie Adjustment
pl: Korekta kalorii

source: Goal TDEE
pl: Docelowe TDEE

source: kcal/day
pl: kcal/dzień

source: Sync Now
pl: Synchronizuj teraz

source: Use
pl: Użyj

source: Kilograms
pl: Kilogramy

source: Pounds
pl: Funty

source: Centimeters
pl: Centymetry

source: Inches
pl: Cale

# sedentary
source: Sedentary (little or no exercise)
pl: Siedzący (mało lub brak ćwiczeń)

# lightlyActive
source: Lightly active (1-3 days per week)
pl: Lekko aktywny (1-3 dni w tygodniu)

# moderatelyActive
source: Moderately Active (moderate exercise 3-5 days/week)
pl: Umiarkowanie aktywny (umiarkowane ćwiczenia 3-5 dni w tygodniu)

# veryActive
source: Very Active (hard exercise 6-7 days/week)
pl: Bardzo aktywny (intensywne ćwiczenia 6-7 dni w tygodniu)

# extraActive
source: Extra Active (very hard exercise & physical job or 2x training)
pl: Bardzo intensywnie aktywny (bardzo ciężkie ćwiczenia i praca fizyczna lub trening 2x dziennie)

source: Language
pl: Język

source: Please select your language
pl: Wybierz swój język

source: English
pl: Angielski

source: Spanish
pl: Hiszpański

source: Portuguese
pl: Portugalski

source: German
pl: Niemiecki

source: French
pl: Francuski

source: Italian
pl: Włoski

source: Japanese
pl: Japoński

source: Korean
pl: Koreański

source: Russian
pl: Rosyjski

source: Chinese
pl: Chiński

source: Turkish
pl: Turecki

source: Polish
pl: Polski

source: Health Services
pl: Usługi zdrowotne

source: Available on your device
pl: Dostępne na Twoim urządzeniu

source: Not available on your device
pl: Nie dostępne na Twoim urządzeniu

source: Authorization
pl: Autorizacja

source: Access granted
pl: Dostęp przyznany

source: Access not granted
pl: Dostęp nie przyznany

source: Never synced
pl: Nigdy nie synchronizowano

source: Grant Access
pl: Przyznaj dostęp

source: Last Sync
pl: Ostatnia synchronizacja

source: Choose your language
pl: Wybierz język

# selectYourPreferredLanguageForTheApp
source: Select your preferred language for the app. The app will restart to apply the changes
pl: Wybierz preferowany język aplikacji. Aplikacja zostanie ponownie uruchomiona, aby zastosować zmiany

source: Grant Apple Health Access
pl: Udziel dostępu do Apple Health

source: Sync with Apple Health
pl: Synchronizuj z Apple Health

source: Apple Health Integration
pl: Integracja z Apple Health

source: Health Connect Integration
pl: Integracja z Health Connect

# appleHealthExplanation
source: This app uses Apple Health data to track weight and activity. You can enable or disable this anytime in Apple Health settings.
pl: Ta aplikacja używa danych Apple Health do śledzenia wagi i aktywności. Możesz to włączyć lub wyłączyć w dowolnym momencie w ustawieniach Apple Health.

# healthConnectExplanation
source: This app uses Health Connect data to track weight and activity. You can enable or disable this anytime in Health Connect settings.
pl: Ta aplikacja używa danych Health Connect do śledzenia wagi i aktywności. Możesz to włączyć lub wyłączyć w dowolnym momencie w ustawieniach Health Connect.

source: Import weight from Apple Health
pl: Importuj wagę z Apple Health

source: Import weight from Health Connect
pl: Importuj wagę z Health Connect

source: Sort by
pl: Sortuj według

source: Date ascending
pl: Data rosnąco

source: Date descending
pl: Data malejąco

source: Weight ascending
pl: Waga rosnąco

source: Weight descending
pl: Waga malejąco
